k6_output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: tests/performance/gate-load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 4m0s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 3m30s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)

time="2026-01-13T07:26:23+01:00" level=info msg="Starting AgentKern Gate performance test" source=console
time="2026-01-13T07:26:23+01:00" level=info msg="Target URL: http://localhost:3001" source=console
time="2026-01-13T07:26:23+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:23+01:00" level=error msg="Gate server not reachable, test may fail" source=console
time="2026-01-13T07:26:23+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:23+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"

running (0m01.0s), 01/50 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 01/50 VUs  0m01.0s/3m30.0s
time="2026-01-13T07:26:24+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:24+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"

running (0m02.0s), 01/50 VUs, 1 complete and 0 interrupted iterations
default   [   1% ] 01/50 VUs  0m02.0s/3m30.0s
time="2026-01-13T07:26:25+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:25+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"

running (0m03.0s), 01/50 VUs, 2 complete and 0 interrupted iterations
default   [   1% ] 01/50 VUs  0m03.0s/3m30.0s
time="2026-01-13T07:26:26+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:26+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:26+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:26+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"

running (0m04.0s), 02/50 VUs, 3 complete and 0 interrupted iterations
default   [   2% ] 02/50 VUs  0m04.0s/3m30.0s
time="2026-01-13T07:26:27+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:27+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:27+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:27+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"

running (0m05.0s), 02/50 VUs, 5 complete and 0 interrupted iterations
default   [   2% ] 02/50 VUs  0m05.0s/3m30.0s
time="2026-01-13T07:26:28+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:28+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:28+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:28+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"

running (0m06.0s), 02/50 VUs, 7 complete and 0 interrupted iterations
default   [   3% ] 02/50 VUs  0m06.0s/3m30.0s
time="2026-01-13T07:26:29+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:29+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:29+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:29+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:29+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:29+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"

running (0m07.0s), 03/50 VUs, 9 complete and 0 interrupted iterations
default   [   3% ] 03/50 VUs  0m07.0s/3m30.0s
time="2026-01-13T07:26:30+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:30+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:30+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:30+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:30+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:30+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"

running (0m08.0s), 03/50 VUs, 12 complete and 0 interrupted iterations
default   [   4% ] 03/50 VUs  0m08.0s/3m30.0s
time="2026-01-13T07:26:31+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:31+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:31+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:31+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:31+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:31+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"

running (0m09.0s), 03/50 VUs, 15 complete and 0 interrupted iterations
default   [   4% ] 03/50 VUs  0m09.0s/3m30.0s
time="2026-01-13T07:26:32+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:32+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:32+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:32+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:32+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:32+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"

running (0m10.0s), 03/50 VUs, 18 complete and 0 interrupted iterations
default   [   5% ] 03/50 VUs  0m10.0s/3m30.0s
time="2026-01-13T07:26:33+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:33+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:33+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:33+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:33+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:33+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:33+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:33+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"

running (0m11.0s), 04/50 VUs, 21 complete and 0 interrupted iterations
default   [   5% ] 04/50 VUs  0m11.0s/3m30.0s
time="2026-01-13T07:26:34+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:34+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:34+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:34+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:34+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:34+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:34+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:34+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"

running (0m12.0s), 04/50 VUs, 25 complete and 0 interrupted iterations
default   [   6% ] 04/50 VUs  0m12.0s/3m30.0s
time="2026-01-13T07:26:35+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:35+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:35+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:35+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:35+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:35+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:35+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:35+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"

running (0m13.0s), 04/50 VUs, 29 complete and 0 interrupted iterations
default   [   6% ] 04/50 VUs  0m13.0s/3m30.0s
time="2026-01-13T07:26:36+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:36+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:36+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:36+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:36+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:36+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:36+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:37+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:37+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:37+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"

running (0m14.0s), 05/50 VUs, 33 complete and 0 interrupted iterations
default   [   7% ] 05/50 VUs  0m14.0s/3m30.0s
time="2026-01-13T07:26:37+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:37+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:37+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:37+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:38+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:38+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:38+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:38+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:38+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:38+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"

running (0m15.0s), 05/50 VUs, 38 complete and 0 interrupted iterations
default   [   7% ] 05/50 VUs  0m15.0s/3m30.0s
time="2026-01-13T07:26:38+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:38+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:38+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:38+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:39+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:39+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:39+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:39+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:39+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:39+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"

running (0m16.0s), 05/50 VUs, 43 complete and 0 interrupted iterations
default   [   8% ] 05/50 VUs  0m16.0s/3m30.0s
time="2026-01-13T07:26:39+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:39+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:39+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:39+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:39+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:39+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:40+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:40+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:40+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:40+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:40+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:40+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"

running (0m17.0s), 06/50 VUs, 48 complete and 0 interrupted iterations
default   [   8% ] 06/50 VUs  0m17.0s/3m30.0s
time="2026-01-13T07:26:40+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:40+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:40+01:00" level=warning msg="Request Failed" error="Get \"http://localhost:3001/health\": dial tcp 127.0.0.1:3001: connect: connection refused"
time="2026-01-13T07:26:40+01:00" level=warning msg="Request Failed" error="Post \"http://localhost:3001/verify\": dial tcp 127.0.0.1:3001: connect: connection refused"

running (0m18.0s), 06/50 VUs, 54 complete and 0 interrupted iterations
default   [   9% ] 06/50 VUs  0m18.0s/3m30.0s

running (0m19.0s), 06/50 VUs, 60 complete and 0 interrupted iterations
default   [   9% ] 06/50 VUs  0m19.0s/3m30.0s

running (0m20.0s), 06/50 VUs, 66 complete and 0 interrupted iterations
default   [  10% ] 06/50 VUs  0m20.0s/3m30.0s

running (0m21.0s), 07/50 VUs, 72 complete and 0 interrupted iterations
default   [  10% ] 07/50 VUs  0m21.0s/3m30.0s

running (0m22.0s), 07/50 VUs, 79 complete and 0 interrupted iterations
default   [  10% ] 07/50 VUs  0m22.0s/3m30.0s

running (0m23.0s), 07/50 VUs, 86 complete and 0 interrupted iterations
default   [  11% ] 07/50 VUs  0m23.0s/3m30.0s
time="2026-01-13T07:26:47+01:00" level=info msg="Test completed. Started at: 2026-01-13T06:26:23.251Z" source=console


  █ THRESHOLDS 

    errors
    ✗ 'rate<0.01' rate=100.00%

    http_req_duration
    ✓ 'p(95)<50' p(95)=1.5ms

    http_req_failed
    ✗ 'rate<0.01' rate=56.21%

    verify_latency
    ✓ 'p(99)<100' p(99)=25.36


  █ TOTAL RESULTS 

    checks_total.......: 500    20.935261/s
    checks_succeeded...: 46.20% 231 out of 500
    checks_failed......: 53.80% 269 out of 500

    ✗ health status is 200
      ↳  44% — ✓ 44 / ✗ 56
    ✗ health response is healthy
      ↳  44% — ✓ 44 / ✗ 56
    ✗ verify status is 200
      ↳  44% — ✓ 44 / ✗ 56
    ✗ verify has requestId
      ↳  0% — ✓ 0 / ✗ 100
    ✗ verify latency under 50ms
      ↳  99% — ✓ 99 / ✗ 1

    CUSTOM
    errors.........................: 100.00% 100 out of 100
    verify_latency.................: avg=1.79     min=0       med=1      max=61     p(90)=2      p(95)=2     

    HTTP
    http_req_duration..............: avg=473.36µs min=0s      med=0s     max=2.06ms p(90)=1.33ms p(95)=1.5ms 
      { expected_response:true }...: avg=1.08ms   min=510.1µs med=1.09ms max=2.06ms p(90)=1.52ms p(95)=1.67ms
    http_req_failed................: 56.21%  113 out of 201
    http_reqs......................: 201     8.415975/s

    EXECUTION
    iteration_duration.............: avg=1.01s    min=1s      med=1s     max=1.44s  p(90)=1s     p(95)=1.06s 
    iterations.....................: 92      3.852088/s
    vus............................: 7       min=1          max=7 
    vus_max........................: 50      min=50         max=50

    NETWORK
    data_received..................: 24 kB   983 B/s
    data_sent......................: 16 kB   683 B/s



running (0m23.9s), 00/50 VUs, 92 complete and 8 interrupted iterations
default ✗ [  11% ] 02/50 VUs  0m23.9s/3m30.0s
time="2026-01-13T07:26:47+01:00" level=error msg="test run was aborted because k6 received a 'interrupt' signal"